using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HwT3
{
    //Evdokhin Denis

    //3. Решить задачу с логинами из предыдущего урока, только логины и пароли считать из файла в массив.

    class Program
    {
        static void Main(string[] args)
        {
            // АААААААААААААААААААА!!!!!!!!!!!!!!!
            // я потратил 6 часов на решение проблемы с записью новых данных к файл с ключом, что за е****я х**ь?! // - это просто эмоции, не думайте что я неадекват =) 
            // пожалуйста ОБРАТИТЕ СЮДА ВНИМАНИЕ и объясните мне почему у меня постоянно возникала ошибка с правами доступа,
            // до тех пор пока я не стал удалять первоначальный файл и просто создавать новый
            
            // P.S.: метод ChangeKeyFile...
            TestLP.Start();
        }
    }
}
