using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HwT4
{
    // Evdokhin Denis

    //4. *а) Реализовать класс для работы с двумерным массивом.Реализовать конструктор, заполняющий массив случайными числами.
    //Создать методы, которые возвращают сумму всех элементов массива, сумму всех элементов массива больше заданного,
    //свойство, возвращающее минимальный элемент массива, свойство, возвращающее максимальный элемент массива, метод,
    //возвращающий номер максимального элемента массива(через параметры, используя модификатор ref или out)

    //** б) Добавить конструктор и методы, которые загружают данные из файла и записывают данные в файл.
    
        
        
        
        // Дополнительные задачи
    //5. ** Существует алгоритмическая игра “Удвоитель”. В этой игре человеку предлагается какое-то число, а человек должен, управляя роботом “Удвоитель”, достичь этого числа за минимальное число шагов.Робот умеет выполнять несколько команд: увеличить число на 1, умножить число на 2 и сбросить число до 1. Начальное значение удвоителя равно 1.

    //Реализовать класс “Удвоитель”. Класс хранит в себе поле current - текущее значение, finish - число, которого нужно достичь, конструктор, в котором задается конечное число.Методы: увеличить число на 1, увеличить число в два раза, сброс текущего до 1, свойство Current, которое возвращает текущее значение, свойство Finish, которое возвращает конечное значение.Создать с помощью этого класса игру, в которой компьютер загадывает число, а человек.выбирая из меню на экране, отдает команды удвоителю и старается получить это число за наименьшее число ходов.Если человек получает число больше положенного, игра прекращается.
    //6. ***Написать игру “Верю.Не верю”. В файле хранятся некоторые данные и правда это или нет. Например: “Шариковую ручку изобрели в древнем Египте”, “Да”.


    //Компьютер загружает эти данные, случайным образом выбирает 5 вопросов и задает их игроку.
    //Игрок пытается ответить правда или нет, то что ему загадали и набирает баллы.Список вопросов ищите во вложении или можно воспользоваться Интернетом.
    //Достаточно решить 3 задачи.Старайтесь разбивать программы на подпрограммы.Переписывайте в начало программы условие и свою фамилию. Все программы сделать в одном решении.

    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}
